tap "browsh-org/browsh"
brew "arp-scan"
brew "blueutil"
brew "btop"
brew "readline"
brew "cmake"
brew "cowsay"
brew "exiftool"
brew "eza"
brew "libevent"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "gnupg"
brew "grafana", restart_service: :changed
brew "imagemagick"
brew "jansson"
brew "libconfig"
brew "libvirt", restart_service: :changed
brew "python@3.14"
brew "llvm"
brew "lua"
brew "lynx"
brew "mcat"
brew "midnight-commander"
brew "neovim"
brew "nmap"
brew "nnn"
brew "nvm"
brew "ollama", restart_service: :changed
brew "pandoc"
brew "pipx"
brew "pkgconf"
brew "potrace"
brew "prometheus", restart_service: :changed
brew "pyenv"
brew "pyenv-virtualenv"
brew "qemu"
brew "qpdf"
brew "ranger"
brew "ripgrep"
brew "texlive"
brew "tgpt"
brew "wget"
cask "claude"
cask "cursor"
cask "discord"
cask "firefox"
cask "google-chrome"
cask "hyper"
cask "iina"
cask "inkscape"
cask "nordvpn"
cask "obsidian"
cask "opera"
cask "transmission"
cask "warp"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "juanblanco.solidity"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.hexeditor"
vscode "openai.chatgpt"
vscode "rust-lang.rust-analyzer"
vscode "swiftlang.swift-vscode"
vscode "vadimcn.vscode-lldb"
